/**
 * fin = financial
 * led = ledger
 * com = compare
 * Cols = Columns
 */

let finData = [], //财务账数据(文件名含"多谱到账"或财务账四字)
    ledData = [], //台账未结清数据，用于比对处理（文件名含"台账"二字, sheets以"台账"二字结尾）
    ledDone = []; //存放已结清的台账，允许导出已经结清的台账

let comMatched = [], //对比结果: 已匹配
    comMissed = [], //对比结果: 缺台账
    comUnmatched = [], //对比结果: 未匹配
    comMerged = [], //对比结果: 合并结果（输出excel)
    refMerged = []; //对比结果: 输出excel时用的参考

let finCols = ["形式", "到款日期", "对方户名", "到款金额", "备注"], //从财务账提取字段
    finWidths = [60, 80, 400, 80, 400], //导出账务帐的列宽
    finPreview = finCols;

let ledCols = [].concat(
        ["客户等级", "项目来源", "月份", "区域", "业绩业务员", "项目类型", "项目编号"], //从从台账提取字段
        ["委托方", "合同额", "合作费", "其他费用", "评审费", "应收款", "净额"],
        ["已收款", "欠款额", "结清情况", "负责人", "业务员", "提交日期", "开票逾期天数"],
        ["合同归档类型", "签订日期", "采样/评审日期", "开票日期", "到款日期", "到款金额", "归属地"]
    ),
    ledWidths = [].concat(
        [60, 80, 50, 60, 80, 80, 100], //导出台账的列宽
        [400, 80, 80, 80, 80, 80, 80],
        [80, 80, 60, 60, 100, 80, 80],
        [80, 80, 100, 80, 80, 60, 100]
    ),
    ledPreview = ["项目类型", "项目编号", "委托方", "应收款", "业务员", "到款日期", "到款金额", "归属地"]; //屏幕上回显的列

let comCols = [].concat(
        ["月份", "形式", "到款日期", "对方户名", "到款金额", "类型", "区域"], //对比结果表头
        ["项目编号", "业务员", "是否开票", "备注", "所在系统", "财务到款", "匹配状态"]
    ),
    comWidths = [50, 100, 80, 400, 80, 80, 80, 80, 100, 60, 300, 60, 60, 60],
    comPreview = ["到款日期", "对方户名", "区域", "项目编号", "业务员", "到款金额", "财务到款", "匹配状态"];


let ledComCols = [...ledCols, "匹配状态"], //比对账台账表头
    ledComWidths = [...ledWidths, 60]; //宽度

let currencyList = ["月份", "合同额", "合作费", "其他费用", "评审费", "应收款", "净额", "开票逾期天数", "到款金额"], //提取后，转成数值型的字段
    dateList = ["提交日期", "签订日期", "采样/评审日期", "开票日期", "到款日期"]; //提取后，会转成 YYYY/M/D 形式的字段

/**
 * 月份 = 提取月(finData.到款日期)
 * 形式 = finData.形式
 * 到款日期= finData.到款日期
 * 对方户名 = finData.对方户名
 * 到款金额 = ledData.到款金额
 * 类型 = ledData.项目类型
 * 区域 = ledData.归属地
 * 项目编号 = ledData.项目编号
 * 业务员 = ledData.业务员
 * 是否开票 = ""
 * 备注 = finData.备注
 * 所在系统 = 提取年(finData.到款日期) >= 2023 ? "八骏" : ""
 * 财务到款 = finData.到款金额
 */

let colorSets = {
    0: { 未匹配: "D9D9D9", 单行匹配: "CCD9CB", 折分匹配: "CBD2D9", 缺台账: "D9B9B9", 无财务账: "D9D9D9" }, //偶数行
    1: { 未匹配: "FFFFFF", 单行匹配: "F0FFEF", 折分匹配: "EFF7FF", 缺台账: "FFDADA", 无财务账: "FFFFFF" } //奇数行
};
